; domain
(define (domain block-words)
  (:requirements :strips :typing :equality)
  (:types block)
  (:predicates (on ?x ?y - block)
	       (ontable ?x - block)
	       (clear ?x - block)
	       (handempty)
	       (holding ?x - block)
	       )

  (:action pick-up
	     :parameters (?x - block)
	     :precondition (and (clear ?x) (ontable ?x) (handempty))
	     :effect
	     (and (not (ontable ?x))
		   (not (clear ?x))
		   (not (handempty))
		   (holding ?x)))

  (:action put-down
	     :parameters (?x - block)
	     :precondition (holding ?x)
	     :effect
	     (and (not (holding ?x))
		   (clear ?x)
		   (handempty)
		   (ontable ?x)))
  (:action stack
	     :parameters (?x ?y - block)
	     :precondition (and (holding ?x) (clear ?y) (not (= ?x ?y)))
	     :effect
	     (and (not (holding ?x))
		   (not (clear ?y))
		   (clear ?x)
		   (handempty)
		   (on ?x ?y)))
  (:action unstack
	     :parameters (?x ?y - block)
	     :precondition (and (on ?x ?y) (clear ?x) (handempty) (not (= ?x ?y)))
	     :effect
	     (and (holding ?x)
		   (clear ?y)
		   (not (clear ?x))
		   (not (handempty))
		   (not (on ?x ?y)))))

; problem
(define (problem block-words)
	(:domain block-words)
	(:objects
		u s o n t g a c h i - block
	)
	(:init
		(handempty)
		(clear s)
		(ontable s)
		(clear u)
		(ontable u)
		(clear a)
		(on a c)
		(on c o)
		(ontable o)
		(clear t)
		(on t h)
		(on h g)
		(on g n)
		(ontable n)
		(clear i)
		(ontable i)	 
	)
	(:goal (and
		;; can 
		(clear c) (ontable n) (on c a) (on a n)
	))
)

; plan
1. (unstack t h)
   deleted: (clear t) (handempty) (on t h)
   added: (holding t) (clear h)
   goals met: 1 of 4
2. (put-down t)
   deleted: (holding t)
   added: (clear t) (handempty) (ontable t)
   goals met: 1 of 4
3. (unstack h g)
   deleted: (clear h) (handempty) (on h g)
   added: (holding h) (clear g)
   goals met: 1 of 4
4. (stack h t)
   deleted: (holding h) (clear t)
   added: (clear h) (handempty) (on h t)
   goals met: 1 of 4
5. (unstack g n)
   deleted: (clear g) (handempty) (on g n)
   added: (holding g) (clear n)
   goals met: 1 of 4
6. (stack g h)
   deleted: (holding g) (clear h)
   added: (clear g) (handempty) (on g h)
   goals met: 1 of 4
7. (unstack a c)
   deleted: (clear a) (handempty) (on a c)
   added: (holding a) (clear c)
   goals met: 2 of 4
8. (stack a n)
   deleted: (holding a) (clear n)
   added: (clear a) (handempty) (on a n)
   goals met: 3 of 4
9. (unstack c o)
   deleted: (clear c) (handempty) (on c o)
   added: (holding c) (clear o)
   goals met: 2 of 4
10. (stack c a)
   deleted: (holding c) (clear a)
   added: (clear c) (handempty) (on c a)
   goals met: 4 of 4
